restnet50_sec 2018-05-07 19:50:02.647269
batch size: 16epochs: 27 learning rate: 0.0001delta: 1e-05_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         (None, 200, 200, 3)       0         
_________________________________________________________________
resnet50 (Model)             multiple                  23587712  
_________________________________________________________________
flatten_1 (Flatten)          (None, 2048)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 7)                 14343     
=================================================================
Total params: 23,602,055
Trainable params: 23,548,935
Non-trainable params: 53,120
_________________________________________________________________
Score : 3.1823059393191078 
Accuracy : 51.68570632571197 
Score : 1.3898268021989846 
Accuracy : 51.657843411251115 
