vggface_vgg16_v2_255 2018-06-05 17:54:11.107295
batch size: 256epochs: 200 learning rate: 0.0001delta: 1e-05_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 48, 48, 3)         0         
_________________________________________________________________
conv1_1 (Conv2D)             (None, 48, 48, 64)        1792      
_________________________________________________________________
conv1_2 (Conv2D)             (None, 48, 48, 64)        36928     
_________________________________________________________________
pool1 (MaxPooling2D)         (None, 24, 24, 64)        0         
_________________________________________________________________
conv2_1 (Conv2D)             (None, 24, 24, 128)       73856     
_________________________________________________________________
conv2_2 (Conv2D)             (None, 24, 24, 128)       147584    
_________________________________________________________________
pool2 (MaxPooling2D)         (None, 12, 12, 128)       0         
_________________________________________________________________
conv3_1 (Conv2D)             (None, 12, 12, 256)       295168    
_________________________________________________________________
conv3_2 (Conv2D)             (None, 12, 12, 256)       590080    
_________________________________________________________________
conv3_3 (Conv2D)             (None, 12, 12, 256)       590080    
_________________________________________________________________
pool3 (MaxPooling2D)         (None, 6, 6, 256)         0         
_________________________________________________________________
conv4_1 (Conv2D)             (None, 6, 6, 512)         1180160   
_________________________________________________________________
conv4_2 (Conv2D)             (None, 6, 6, 512)         2359808   
_________________________________________________________________
conv4_3 (Conv2D)             (None, 6, 6, 512)         2359808   
_________________________________________________________________
pool4 (MaxPooling2D)         (None, 3, 3, 512)         0         
_________________________________________________________________
conv5_1 (Conv2D)             (None, 3, 3, 512)         2359808   
_________________________________________________________________
conv5_2 (Conv2D)             (None, 3, 3, 512)         2359808   
_________________________________________________________________
conv5_3 (Conv2D)             (None, 3, 3, 512)         2359808   
_________________________________________________________________
pool5 (MaxPooling2D)         (None, 1, 1, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 512)               0         
_________________________________________________________________
fc6 (Dense)                  (None, 4096)              2101248   
_________________________________________________________________
fc7 (Dense)                  (None, 4096)              16781312  
_________________________________________________________________
fc8 (Dense)                  (None, 7)                 28679     
=================================================================
Total params: 33,625,927
Trainable params: 18,911,239
Non-trainable params: 14,714,688
_________________________________________________________________
Score : 1.5367317927949904 
Accuracy : 41.320702145444415 
             precision    recall  f1-score   support

      Angry       0.36      0.32      0.34       491
    Disgust       0.83      0.09      0.16        55
       Fear       0.36      0.28      0.32       528
      Happy       0.49      0.63      0.55       879
        Sad       0.33      0.33      0.33       594
   Surprise       0.52      0.53      0.52       416
    Neutral       0.35      0.33      0.34       626

avg / total       0.41      0.41      0.40      3589
Score : 1.5347703630693712 
Accuracy : 41.264976316522706 
             precision    recall  f1-score   support

      Angry       0.36      0.32      0.34       491
    Disgust       0.75      0.05      0.10        55
       Fear       0.37      0.29      0.33       528
      Happy       0.48      0.64      0.55       879
        Sad       0.32      0.33      0.33       594
   Surprise       0.54      0.50      0.51       416
    Neutral       0.35      0.33      0.34       626

avg / total       0.41      0.41      0.40      3589
