vggface_vgg16_v2 2018-06-05 11:43:34.013895
batch size: 256epochs: 200 learning rate: 0.0001delta: 1e-05_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_1 (InputLayer)         (None, 48, 48, 3)         0
_________________________________________________________________
conv1_1 (Conv2D)             (None, 48, 48, 64)        1792
_________________________________________________________________
conv1_2 (Conv2D)             (None, 48, 48, 64)        36928
_________________________________________________________________
pool1 (MaxPooling2D)         (None, 24, 24, 64)        0
_________________________________________________________________
conv2_1 (Conv2D)             (None, 24, 24, 128)       73856
_________________________________________________________________
conv2_2 (Conv2D)             (None, 24, 24, 128)       147584
_________________________________________________________________
pool2 (MaxPooling2D)         (None, 12, 12, 128)       0
_________________________________________________________________
conv3_1 (Conv2D)             (None, 12, 12, 256)       295168
_________________________________________________________________
conv3_2 (Conv2D)             (None, 12, 12, 256)       590080
_________________________________________________________________
conv3_3 (Conv2D)             (None, 12, 12, 256)       590080
_________________________________________________________________
pool3 (MaxPooling2D)         (None, 6, 6, 256)         0
_________________________________________________________________
conv4_1 (Conv2D)             (None, 6, 6, 512)         1180160
_________________________________________________________________
conv4_2 (Conv2D)             (None, 6, 6, 512)         2359808
_________________________________________________________________
conv4_3 (Conv2D)             (None, 6, 6, 512)         2359808
_________________________________________________________________
pool4 (MaxPooling2D)         (None, 3, 3, 512)         0
_________________________________________________________________
conv5_1 (Conv2D)             (None, 3, 3, 512)         2359808
_________________________________________________________________
conv5_2 (Conv2D)             (None, 3, 3, 512)         2359808
_________________________________________________________________
conv5_3 (Conv2D)             (None, 3, 3, 512)         2359808
_________________________________________________________________
pool5 (MaxPooling2D)         (None, 1, 1, 512)         0
_________________________________________________________________
flatten (Flatten)            (None, 512)               0
_________________________________________________________________
fc6 (Dense)                  (None, 4096)              2101248
_________________________________________________________________
fc7 (Dense)                  (None, 4096)              16781312
_________________________________________________________________
fc8 (Dense)                  (None, 7)                 28679
=================================================================
Total params: 33,625,927
Trainable params: 33,625,927
Non-trainable params: 0
_________________________________________________________________
Score : 2.7404587335924013
Accuracy : 61.994984678718566
             precision    recall  f1-score   support

      Angry       0.52      0.52      0.52       491
    Disgust       0.90      0.64      0.74        55
       Fear       0.53      0.46      0.49       528
      Happy       0.76      0.83      0.79       879
        Sad       0.48      0.50      0.49       594
   Surprise       0.80      0.74      0.77       416
    Neutral       0.56      0.58      0.57       626

avg / total       0.62      0.62      0.62      3589
Score : 1.172331306156457
Accuracy : 56.283087211752644
             precision    recall  f1-score   support

      Angry       0.44      0.55      0.49       491
    Disgust       0.44      0.36      0.40        55
       Fear       0.45      0.28      0.34       528
      Happy       0.83      0.73      0.78       879
        Sad       0.40      0.55      0.46       594
   Surprise       0.67      0.71      0.69       416
    Neutral       0.57      0.50      0.53       626

avg / total       0.58      0.56      0.56      3589
