vggface_vgg16 2018-04-10 12:04:00.272320
batch size: 256epochs: 200 learning rate: 1e-05delta: 0_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
image_input (InputLayer)     (None, 48, 48, 3)         0         
_________________________________________________________________
vgg16 (Model)                multiple                  14714688  
_________________________________________________________________
flatten (Flatten)            (None, 512)               0         
_________________________________________________________________
fc6 (Dense)                  (None, 4096)              2101248   
_________________________________________________________________
fc7 (Dense)                  (None, 4096)              16781312  
_________________________________________________________________
fc8 (Dense)                  (None, 7)                 28679     
=================================================================
Total params: 33,625,927
Trainable params: 33,625,927
Non-trainable params: 0
_________________________________________________________________
Score : 1.8252760831875932 
Accuracy : 57.39760378977156 
Score : 1.2311810245086106 
Accuracy : 54.444134857336365 
