restnet50 2018-04-07 12:07:21.453219
batch size: 16epochs: 27 learning rate: 0.0001delta: 1e-05_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         (None, 200, 200, 3)       0         
_________________________________________________________________
resnet50 (Model)             multiple                  23587712  
_________________________________________________________________
flatten_1 (Flatten)          (None, 2048)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 7)                 14343     
=================================================================
Total params: 23,602,055
Trainable params: 23,548,935
Non-trainable params: 53,120
_________________________________________________________________
Score : 1.9782090574361781 
Accuracy : 66.62022847755934 
Score : 1.0160077993635281 
Accuracy : 66.7316801370635 
