vggface_vgg162018-05-08 10:30:34.7586822018-05-08 10:59:36.6658952018-05-08 11:21:37.6385842018-05-08 11:43:32.0314492018-05-08 12:05:41.0896542018-05-08 12:27:36.0991952018-05-08 12:53:08.029244 2018-05-08 13:15:03.162251
batch size: 32epochs: 150 learning rate: 3.5410231629016946e-05delta: 5e-05_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 48, 48, 3)         0         
_________________________________________________________________
conv1_1 (Conv2D)             (None, 48, 48, 64)        1792      
_________________________________________________________________
conv1_2 (Conv2D)             (None, 48, 48, 64)        36928     
_________________________________________________________________
pool1 (MaxPooling2D)         (None, 24, 24, 64)        0         
_________________________________________________________________
conv2_1 (Conv2D)             (None, 24, 24, 128)       73856     
_________________________________________________________________
conv2_2 (Conv2D)             (None, 24, 24, 128)       147584    
_________________________________________________________________
pool2 (MaxPooling2D)         (None, 12, 12, 128)       0         
_________________________________________________________________
conv3_1 (Conv2D)             (None, 12, 12, 256)       295168    
_________________________________________________________________
conv3_2 (Conv2D)             (None, 12, 12, 256)       590080    
_________________________________________________________________
conv3_3 (Conv2D)             (None, 12, 12, 256)       590080    
_________________________________________________________________
pool3 (MaxPooling2D)         (None, 6, 6, 256)         0         
_________________________________________________________________
conv4_1 (Conv2D)             (None, 6, 6, 512)         1180160   
_________________________________________________________________
conv4_2 (Conv2D)             (None, 6, 6, 512)         2359808   
_________________________________________________________________
conv4_3 (Conv2D)             (None, 6, 6, 512)         2359808   
_________________________________________________________________
pool4 (MaxPooling2D)         (None, 3, 3, 512)         0         
_________________________________________________________________
conv5_1 (Conv2D)             (None, 3, 3, 512)         2359808   
_________________________________________________________________
conv5_2 (Conv2D)             (None, 3, 3, 512)         2359808   
_________________________________________________________________
conv5_3 (Conv2D)             (None, 3, 3, 512)         2359808   
_________________________________________________________________
pool5 (MaxPooling2D)         (None, 1, 1, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 512)               0         
_________________________________________________________________
fc6 (Dense)                  (None, 4096)              2101248   
_________________________________________________________________
fc7 (Dense)                  (None, 4096)              16781312  
_________________________________________________________________
fc8 (Dense)                  (None, 7)                 28679     
=================================================================
Total params: 33,625,927
Trainable params: 33,625,927
Non-trainable params: 0
_________________________________________________________________
Score : 2.676367593861184 
Accuracy : 60.100306492889445 
