vggface_vgg16_v2 2018-06-05 16:44:55.835191
batch size: 256epochs: 200 learning rate: 0.0005delta: 1e-05_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 48, 48, 3)         0         
_________________________________________________________________
conv1_1 (Conv2D)             (None, 48, 48, 64)        1792      
_________________________________________________________________
conv1_2 (Conv2D)             (None, 48, 48, 64)        36928     
_________________________________________________________________
pool1 (MaxPooling2D)         (None, 24, 24, 64)        0         
_________________________________________________________________
conv2_1 (Conv2D)             (None, 24, 24, 128)       73856     
_________________________________________________________________
conv2_2 (Conv2D)             (None, 24, 24, 128)       147584    
_________________________________________________________________
pool2 (MaxPooling2D)         (None, 12, 12, 128)       0         
_________________________________________________________________
conv3_1 (Conv2D)             (None, 12, 12, 256)       295168    
_________________________________________________________________
conv3_2 (Conv2D)             (None, 12, 12, 256)       590080    
_________________________________________________________________
conv3_3 (Conv2D)             (None, 12, 12, 256)       590080    
_________________________________________________________________
pool3 (MaxPooling2D)         (None, 6, 6, 256)         0         
_________________________________________________________________
conv4_1 (Conv2D)             (None, 6, 6, 512)         1180160   
_________________________________________________________________
conv4_2 (Conv2D)             (None, 6, 6, 512)         2359808   
_________________________________________________________________
conv4_3 (Conv2D)             (None, 6, 6, 512)         2359808   
_________________________________________________________________
pool4 (MaxPooling2D)         (None, 3, 3, 512)         0         
_________________________________________________________________
conv5_1 (Conv2D)             (None, 3, 3, 512)         2359808   
_________________________________________________________________
conv5_2 (Conv2D)             (None, 3, 3, 512)         2359808   
_________________________________________________________________
conv5_3 (Conv2D)             (None, 3, 3, 512)         2359808   
_________________________________________________________________
pool5 (MaxPooling2D)         (None, 1, 1, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 512)               0         
_________________________________________________________________
fc6 (Dense)                  (None, 4096)              2101248   
_________________________________________________________________
fc7 (Dense)                  (None, 4096)              16781312  
_________________________________________________________________
fc8 (Dense)                  (None, 7)                 28679     
=================================================================
Total params: 33,625,927
Trainable params: 33,625,927
Non-trainable params: 0
_________________________________________________________________
Score : 2.6800433555065206 
Accuracy : 59.04151574337705 
             precision    recall  f1-score   support

      Angry       0.49      0.52      0.51       491
    Disgust       0.83      0.55      0.66        55
       Fear       0.43      0.46      0.44       528
      Happy       0.81      0.79      0.80       879
        Sad       0.43      0.44      0.43       594
   Surprise       0.78      0.72      0.75       416
    Neutral       0.54      0.54      0.54       626

avg / total       0.60      0.59      0.59      3589
Score : 1.2047053219781143 
Accuracy : 54.555586515179776 
             precision    recall  f1-score   support

      Angry       0.48      0.43      0.46       491
    Disgust       0.00      0.00      0.00        55
       Fear       0.36      0.34      0.35       528
      Happy       0.84      0.76      0.80       879
        Sad       0.39      0.39      0.39       594
   Surprise       0.81      0.59      0.68       416
    Neutral       0.44      0.68      0.53       626

avg / total       0.56      0.55      0.55      3589
